app/controllers/items_controller.rb

	def index
		if request.method == :get
			@items = Item.all
---
SELECT * FROM "items"

	def create
		@item = Item.new(params[:item])
		#@item = Item.new(article_params)
		@item.save
---
INSERT INTO "items" ("created_at", "price", "inCart", "url", "updated_at", "name", "qty") VALUES('2019-01-29 05:55:20', 15000, NULL, 'laptop.jpeg', '2019-01-29 05:55:20', 'Item4', 1)

	def edit
		@item = Item.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 10)

	def update
		@item = Item.find(params[:id])
		Item.update(params[:id],params[:item])
---
SELECT * FROM "items" WHERE ("items"."id" = 10)
UPDATE "items" SET "updated_at" = '2019-01-29 06:44:39', "inCart" = 't' WHERE "id" = 10

	def put
		if request.method == :options
			render :nothing => true
		else
			@item = Item.find(params[:id])
			Item.update(params[:id],params[:item])
---
SELECT * FROM "items" WHERE ("items"."id" = 11)
UPDATE "items" SET "updated_at" = '2019-02-27 05:48:19', "inCart" = 'f', "qty" = 1 WHERE "id" = 33